<a href="https://colab.research.google.com/github/yhy0519/The_first_step_of_Python/blob/main/python18_12_21.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**■ 148. 파이썬과 Oracle 연동**

                          연동
    오라클 database ---------------- 파이썬  ( 통계구현, 시각화, 머신러닝, 업무자동화 )
        ↓
    비지니스 데이터       emp2.csv
    (정형화된 데이터)     emp1222.csv


** 오라클과 파이썬을 연동하는 이유 ?
 1. 오라클 데이터 베이스에서 실시간으로 변하는 데이터를 csv 파일로 매번 내려받으려면
    자주 내려받아야 하므로 그냥 바로 연동합니다.

 2. 파이썬의 여러 장점들을 이용해서 데이터를 분석할 수 있기 때문입니다.
    ( 통계구현, 시각화, 머신러닝 구현, 업무자동화 )

 3. 폐사진을 숫자로 변환해서 오라클 database 에 저장합니다.
    이미지를 숫자로 변환해서 오라클 database 에 저장합니다.
    db 에 저장하고 관리를 합니다. os 에 파일로 남겨만 두지 않습니다.
    db 에 저장하면 장점이 백업과 복구를 할 수 있다. 
    그리고 좀 더 효율적으로 data 를 관리 할 수 있습니다.
    os 에 파일로 저장되어 있으면 바이러스에 노출될 수 도 있습니다.
    

** 빅데이터 기사 시험 : 데이터 구조에 따른 종류 3가지

 1. 정형화 데이터 : rdbms 에 저장된 데이터  
rdbms : relational database management system 
  (관계형 데이터 베이스 관리 시스템)
 2. 반정형화 데이터 :html, 웹로그 데이터
 3. 비정형화 데이터 : 텍스트(SNS), 이미지, 동영상 데이터
				 

** 오라클과 파이썬 연동

 1. 도스창을 열고 리스너의 상태를 확인합니다.

    리스너 상태 확인하는 명령어
    
        lsnrctl status
     
    외부에서 오라클에 접속하려면 리스너를 통해야지만 접속이 가능합니다.
    리스너가 접속을 허용해주어야 접속이 가능한 것입니다.
    리스너가 가지고 있는 정보 중 3가지를 확인해야합니다. 
	 1. ip 주소    (건물주소) : localhost
	 2. 포트번호  (건물안의 복도) : 1522
	 3. 서비스 이름 (회사이름) : orcl2

 2. 위의 정보들을 이용해서 오라클 database 에 접속을 해봅니다.

        sqlplus sys/oracle as sysdba
        exit
        sqlplus sys/oracle_4U@localhost:1522/orcl2 as sysdba

 3. 아나콘다 프롬프트창을 열고 cx_Oracle 모듈을 설치합니다.  

        conda install cx_Oracle

 4. 파이썬에서 오라클과 연동하는 코드를 작성한다.
    ( python 에서 작성 )

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 포트번호, 'orcl2')       # 오라클 주소를 기입한다.
db = cx_Oracle.connect('오라클 사용자 이름', '오라클 사용자 비밀번호', dsn, cx_Oracle.SYSDBA)    # 오라클 접속 유져 정보
cursor = db.cursor()                        # 결과 데이터를 담을 메모리 이름을 cursor 로 선언
cursor.execute("""select * from emp""")     # 쿼리문 작성. 
                                           # 작성한 쿼리문의 결과가 cursor 메모리에 담긴다.
row = cursor.fetchall()             # cursor 메모리에 담긴 결과를 한번에 row 변수에 담는다.
emp = pd.DataFrame(row)
print(emp)

문제440. 위의 emp 테이블 전체를 select 했는데 전체를 다 select 하지 말고 아래의 쿼리의 결과만 select 하시오 ! 

    select empno, ename, sal, deptno
       from emp;

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select empno, ename, sal, deptno from emp""")
row = cursor.fetchall() 
emp = pd.DataFrame(row)
print(emp)

문제441. dept 테이블의 모든 데이터를 조회하시오 !

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4u', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select * from dept""")
row = cursor.fetchall()
dept = pd.DataFrame(row)
print(dept)

문제442. 우리반 테이블(emp12) 를 조회하시오 !

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4u', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select * from emp12""")
row = cursor.fetchall()
emp12 = pd.DataFrame(row)
print(emp12)

문제443. 월급이 1200 이상인 사원들의 이름과 월급을 출력하시오 !

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select ename, sal from emp where sal >= 1200""")
row = cursor.fetchall() 
emp = pd.DataFrame(row)
print(emp)

문제444. 사원 테이블의 월급을 막대 그래프로 그리시오 !

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select ename, sal from emp""")
row = cursor.fetchall() 
emp = pd.DataFrame(row)
emp.index = list(emp[0])
emp.plot(kind = 'bar')

문제445. 위의 그래프의 색깔을 변경하고 그래프를 그리세요

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select ename, sal from emp""")
row = cursor.fetchall() 
emp = pd.DataFrame(row)
emp.index = list(emp[0])
emp.plot(kind = 'bar', color = 'yellow')

문제446. 직업, 직업별 최대월급을 출력하시오 !

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select job, max(sal) from emp group by job""")
row = cursor.fetchall() 
emp = pd.DataFrame(row)
print(emp)

문제447. 직업, 직업별 토탈월급을 출력하는데 직업별 토탈월급이 높은것부터 출력하시오 !

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select job, sum(sal) 
                    from emp 
                    group by job 
                    order by sum(sal) desc""")
row = cursor.fetchall() 
emp = pd.DataFrame(row)
print(emp)

문제448. 이름, 월급, 순위를 출력하는데 순위가 월급이 높은 사원순으로 순위를 부여하시오 !

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select ename, sal, dense_rank() over (order by sal desc) rnk
                    from emp""")
row = cursor.fetchall() 
emp = pd.DataFrame(row)
print(emp)

문제449. 부서번호, 부서번호별 토탈월급을 출력하시오 !

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select deptno, sum(sal)
                    from emp
                    group by deptno""")
row = cursor.fetchall() 
emp = pd.DataFrame(row)
print(emp)

문제450. 위의 결과를 막대그래프로 시각화 하시오 !

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select deptno, sum(sal)
                    from emp
                    group by deptno""")

row = cursor.fetchall()   
emp = pd.DataFrame(row)
emp.index=list(emp[0])
emp.plot(kind='bar',color='blue')

문제451. emp 테이블 컬럼명을 출력하시오 !

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select * from emp""")
row = cursor.fetchall() 
emp = pd.DataFrame(row)
colname = cursor.description
col = []
for i in colname:
    col.append( i[0].lower() )
print(col)

문제452. 위의 col 리스트에 담긴 컬럼명을 위의 데이터에 매핑시키시오

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select * from emp""")
row = cursor.fetchall() 
emp = pd.DataFrame(row)
colname = cursor.description
col = []
for i in colname:
    col.append( i[0].lower() )
emp = pd.DataFrame(list(row), columns = col)
print(emp)

문제453. 위의 컬럼명을 이용해서 판다스 문법으로 이름과 월급을 출력하시오

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select * from emp""")
row = cursor.fetchall() 
emp = pd.DataFrame(row)
colname = cursor.description
col = []
for i in colname:
    col.append( i[0].lower() )
emp = pd.DataFrame(list(row), columns = col)

print(emp[['ename', 'sal']])

문제454. 월급이 3000 이상인 사원들의 이름과 월급을 출력하시오 !

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select * from emp""")
row = cursor.fetchall() 
emp = pd.DataFrame(row)
colname = cursor.description
col = []
for i in colname:
    col.append( i[0].lower() )
emp = pd.DataFrame(list(row), columns = col)

print(emp[['ename', 'sal']] [emp['sal'] >= 3000])

문제455. 이름과 부서위치를 출력하시오 ! ( 그냥 SQL 로 작성해서 파이썬에서 출력되게하시오 )

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select e.ename, d.loc 
                          from emp e, dept d 
                          where e.deptno = d.deptno""")
row = cursor.fetchall() 
emp = pd.DataFrame(row)
print(emp)

문제456. 부서위치, 부서위치별 토탈월급을 출력하시오 !

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select d.loc, sum(sal) 
                          from emp e, dept d 
                          where e.deptno = d.deptno 
                          group by d.loc""")
row = cursor.fetchall() 
emp = pd.DataFrame(row)
print(emp)

문제457. 위의 결과를 막대그래프로 시각화 하시오 !

In [ ]:
import cx_Oracle
import pandas as pd

dsn = cx_Oracle.makedsn("localhost", 1522, 'orcl2')
db = cx_Oracle.connect('sys', 'oracle_4U', dsn, cx_Oracle.SYSDBA)
cursor = db.cursor()
cursor.execute("""select d.loc, sum(sal) from emp e, dept d where e.deptno = d.deptno group by d.loc""")
row = cursor.fetchall() 
emp = pd.DataFrame(row)
emp.index = list(emp[0])
emp.plot(kind = 'bar', color = 'violet')

**■ 149. 파이썬과 mySQL 연동**

현업에서는 오라클도 많이 쓰지만 mySQL 도 많이 사용합니다.  
오라클은 가격이 많이나가서 중요한 데이터(Business data)는 오라클에 저장하고
상대적으로 덜 중요한 데이터는 mySQL 에 저장합니다.

MySQL을 실행하고 database를 실행하고 생성하는 방법

    mysql> create database orcl;
    mysql> use orcl;

emp, dept 테이블 생성.

    mysql> select * from emp;

문제458. 월급이 3000 이상인 사원들의 이름과 월급을 출력하시오 !

    mysql> 
    select ename, sal
       from emp
       where sal >= 3000;

문제459. 직업이 SALESMAN 인 사원들의 이름과 월급과 직업을 출력하는데
	     월급이 높은 사원부터 출력하시오 !

    mysql> 
    select ename, sal, job
       from emp
       where job = 'SALESMAN'
       order by sal desc;

문제460. 이름과 부서위치를 출력하시오 !

    mysql> 
    select e.ename, d.loc
       from emp e, dept d
       where e.deptno = d.deptno;

문제461. JONES 보다 더 많은 월급을 받는 사원들의 이름과 월급을 출력하시오 ! (서브쿼리문)

    mysql> 
    select ename, sal
       from emp
       where sal > (select sal
                       from emp
                       where ename = 'JONES');

문제462. 이름, 월급, 순위를 출력하시오 ! (순위는 월급이 높은 순으로 순위를 부여)

    mysql> 
    select ename, sal, rank() over (order by sal desc)
       from emp;

**■ Oracle 과 MySQL 함수 비교**

	  Oracle	   vs	  MySQL
    1.  nvl		       ifnull
    2.  sysdate		   sysdate()
    3.  months_between	period_add
    4.  decode		       if
    5.  rollup		    with rollup
    6.  listagg		   group_concat

문제463. 이름, 커미션을 출력하는데 커미션이 null 인 사람들은 0으로 출력하시오 !

    mysql> 
    select ename, ifnull( comm, 0 )
       from emp;

문제464. 오늘 날짜를 출력하시오 !

오라클

    select sysdate
       from dual;

MySQL

    mysql> 
    select sysdate()
       ;

설명: mySQL 은 오라클과 같은 dual 이 없음

문제465. 부서번호, 부서번호별 토탈월급을 출력하시오 !

    mysql> 
    select deptno, sum(sal)
       from emp
       group by deptno;

문제466. 위의 결과를 다시 출력하는데 맨 아래에 전체 토탈월급이 출력되게하시오 !

    mysql> 
    select deptno, sum(sal)
       from emp
       group by deptno with rollup;

※ 이제부터 아주 중요

문제467. scott 의 월급을 0 으로 변경하세요 ~

    mysql> 
    update emp
       set sal = 0
       where ename = 'SCOTT';

    rollback;

※ mysql 은 오라클과는 다르게 기본 자동 commit 이 활성화 되어있다.
   자동 commit 되어버려서 rollback 을 할 수 없습니다.
   mySQL 사용자들이 많이 하는 실수중에 하나

문제468. 자동 commit 이 활성화 되어져 있는지 확인해보세요 ~

    mysql> select @@autocommit;

설명: 숫자 1이면 autocommit 이 켜있는 것입니다.

문제469. 자동 commit 기능을 끄세요 ~

    mysql> set autocommit = FALSE;

    mysql> select @@autocommit;

설명: 숫자가 0 이면 자동 commit 기능이 비활성화 된 것입니다.

문제470. KING 의 월급을 0 으로 변경하세요

    mysql> update emp
       set sal = 0
       where ename = 'KING';

    mysql> rollback;

설명: mySQL 을 켰으면 제일 먼저 확인해야하는것이 자동 commit 이 활성화 되었는지
	확인하는게 아주 중요합니다 !

문제471. 오라클의 listagg 함수와 같은 기능인 group_concat 을 이용해서 부서번호, 부서번호별로 속한 사원들의 이름을 가로로 출력하시오 !

    mysql> 
    select deptno, group_concat(ename)
       from emp
       group by deptno;

문제472. mySQL 과 파이썬을 연동해서 mySQL 의 emp 테이블을 파이썬에서 출력하시오 !

먼저 아나콘다 프롬프트 창을 열고 pymysql 을 설치하세요 !

    conda install pymysql


스파이더에서 아래 코드 입력

In [ ]:
import pymysql, pandas as pd

conn = pymysql.connect(host="localhost", user="root", password="oracle", db="orcl", charset="utf8")

curs = conn.cursor()
sql = "select * from emp"
curs.execute(sql)
rows = curs.fetchall()
colname = curs.description
col = []
for i in colname:
    col.append(i[0].lower())
emp = pd.DataFrame(list(rows),columns=col)
print(emp[['ename', 'sal']] )

문제473. 직업, 직업별 토탈월급을 출력하시오 !

In [ ]:
import pymysql,pandas as pd

conn = pymysql.connect(host="localhost", user="root",password="oracle", db="orcl",charset="utf8")

curs = conn.cursor()
sql = "select job, sum(sal) from emp group by job"
curs.execute(sql)
rows = curs.fetchall()
colname = curs.description
col = []
for i in colname:
    col.append(i[0].upper())
emp = pd.DataFrame(list(rows),columns=col)
print(emp)

문제474. 위의 결과를 막대그래프로 시각화 하시오 !

In [ ]:
import pymysql
import pandas as pd

conn = pymysql.connect(host="localhost", user="root",password="oracle",
db="orcl",charset="utf8")

curs = conn.cursor()
sql = """ select job, sum(sal) from emp group by job """

curs.execute(sql)
row = curs.fetchall()
emp = pd.DataFrame(row)
print(emp)

for i in emp.columns:
try:
emp[i]=emp[i].astype(int)
except:
pass
emp.index = list(emp[0])
emp.plot( kind='bar', color='red')

**■ 150. 이미지를 숫자로 변환하는 방법 ( 폐사진 )**

딥러닝 수업을 할 때 이미지를 인공 신경망에 넣어서 학습을 시키는데
인공 신경망에 사진을 넣을 때 숫자로 변환을 해서 넣어야 합니다.

문제475. 오라클과 파이썬을 연동하여 아래의 사원들을 검색하시오 !  
	     이름과 월급과 부서번호와 자기가 속한 부서번호의 평균월급을 출력하는데
	     자신의 월급이 자기가 속한 부서번호의 평균월급보다 더 큰 사원들만 출력하시오 !

오라클

    select e.ename, e.sal, v.부서평균
       from emp e, (select deptno, avg(sal) as 부서평균
                       from emp
                       group by deptno) v
       where e.deptno = v.deptno and e.sal > v.부서평균;

In [ ]:
import pymysql,pandas as pd

conn = pymysql.connect(host="localhost", user="root",password="oracle", db="orcl",charset="utf8")

curs = conn.cursor()
sql = '''select e.ename, e.sal, e.deptno, v.부서평균 
            from emp e, (select deptno, avg(sal) as 부서평균
                            from emp group by deptno) v 
            where e.deptno = v.deptno and e.sal > v.부서평균'''
curs.execute(sql)
rows = curs.fetchall()
colname = curs.description
col = []
for i in colname:
    col.append(i[0].upper())
emp = pd.DataFrame(list(rows),columns=col)
print(emp)